src/cf/Catalogs/СхемаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СхемаЛечения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Диагноз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПрепаратов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Препарат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Препараты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СКакогоДня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СхемаЛечения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)    
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Наименование = НаименованиеСхемыЛечения();
	КонецЕсли;	
	    
КонецПроцедуры

&НаСервере
Функция НаименованиеСхемыЛечения() 
	
	ОписаниеСтроки = Новый ОписаниеТипов("Строка");
	СтрокаДиагноз = ОписаниеСтроки.ПривестиЗначение(Объект.Диагноз.Наименование);
	РасчетДлительности = 0;

	 Для каждого Позиция из Объект.СписокПрепаратов Цикл
		 РасчетДлительности = Макс(РасчетДлительности, Позиция.СКакогоДня + Позиция.Длительность - 1); 
	 КонецЦикла;
	 СтрокаДлительность = ОписаниеСтроки.ПривестиЗначение(РасчетДлительности);
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст =  "ВЫБРАТЬ
	                 |	СхемаЛечения.Ссылка КАК Ссылка
	                 |ИЗ
	                 |	Справочник.СхемаЛечения КАК СхемаЛечения
	                 |ГДЕ
	                 |	СхемаЛечения.Диагноз = &Диагноз"; 
	 
	 Запрос.УстановитьПараметр("Диагноз",Объект.Диагноз);
	 КоличествоСхем = Запрос.Выполнить().Выбрать().Количество() + 1;
	 СтрокаКоличествоСхем = ОписаниеСтроки.ПривестиЗначение(КоличествоСхем);
	 
	 ИтоговоеНаименование = "Сх. леч. для д-за " + СтрокаДиагноз + " №" 
	 			+ СтрокаКоличествоСхем +": " + СтрокаДлительность + " дней";
	 
	 Возврат ИтоговоеНаименование;  
	 
КонецФункции
